html/20231217T064942--build-a-website-with-emacs-and-ox-publish__emacs_websites.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-19 Tue 21:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Build a website with emacs and ox-publish</title>
<meta name="author" content="Arvydas Gasparavicius" />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../static/css/org-html-style-default.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/generic.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/taingram.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/lightbox.css" type="text/css"/>
<link rel="stylesheet" href="../static/css/scroll-to-top.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html">NOTES </a>
 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="updated">Updated: 2023-12-17 Sun 09:10</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Build a website with emacs and ox-publish</h1>
</header><p>
Here is my <a href="https://github.com/arvydasg/org-publish-project-blog">attempt to build a site with ox-publish</a>. But here I will not write
much about it.
</p>

<p>
Just keeping some notes for reference:
</p>

<ul class="org-ul">
<li><a href="https://github.com/arvydasg/org-publish-project-blog">my example</a> contains ALL the possible settings you can set in it. Clearly
ChatGPT was right on this one here - <a href="20231215T182523--building-development-notes-website-with-emacs__emacs_websites.html">building development notes website with Emacs</a></li>
<li>A list of guides how to build pages with ox-publish ir ox-html- <a href="https://pages.gitlab.io/org-mode/post3.html">https://pages.gitlab.io/org-mode/post3.html</a></li>
<li>Emacs docs - <a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a></li>
<li>good nice example - <a href="https://taingram.org/blog/org-mode-blog.html">https://taingram.org/blog/org-mode-blog.html</a></li>
<li>youtube video how it's being used - <a href="https://www.youtube.com/watch?v=Elynmb3kTE4">https://www.youtube.com/watch?v=Elynmb3kTE4</a></li>
<li>create new files with <code>org-structure-template-alist</code></li>
<li>full example of the config - <a href="https://ogbe.net/blog/blogging_with_org">https://ogbe.net/blog/blogging_with_org</a></li>
<li>System crafters example -<a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the">https://systemcrafters.net/publishing-websites-with-org-mode/building-the</a>-</li>
<li>Footnotes are possible</li>
</ul>
</div>
<div id="postamble" class="status">
<hr/>
	 <footer>
	 <div class="copyright-container">
	 <div class="copyright">
	 Copyright &copy; 2023-2023 Arvydas Gasparavicius
	 </div>
	 </div>
	 <p class="date">This org file is created: 2023-12-17 Sun 06:49</p>
	 <p class="date">This org file is last modified: 2023-12-17 Sun 09:10</p>
	 <p class="date">This org file is exported to HTML: 2023-12-19 Tue 21:03</p>
	 <div class="generated">
	Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6) on <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a>
	</div>
	</footer>
	 <button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>
	 <script src="../static/js/generic.js"></script>
	 <script src="../static/js/scroll-to-top.js"></script>
	 <script src="../static/js/lightbox.js"></script>
</div>
</body>
</html>